# -*- coding: utf-8 -*-
# author: 微信号 pp_LoveSmile
# author: 公众号 摸鱼大佬
__author__ = 'Roy T.Burns'

from bs4 import BeautifulSoup
from urllib.request import urlopen
import sys
import time
import datetime
import pandas as pd
import gzip
import requests
from selenium import webdriver
from selenium.webdriver.chrome.options import Options
phantomjs_path = r'D:\devtools\phantomjs-2.1.1-windows\bin\phantomjs.exe'


url_1 = "https://xuangubao.cn"
url_2 = "https://xuangubao.cn/dingpan"

# if has Chinese, apply decode()
# resp = urlopen(url)#.read().decode('utf-8')
# content = resp.read() # content是压缩过的数据
# html = gzip.decompress(content).decode('utf-8')
# print(html)

# headers = {
#     'Accept': 'application/json, text/plain, */*',
#     # 'Origin':'',
#     'Referer':url,
#     'User-Agent':'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/72.0.3626.121 Safari/537.36'
# }

# data = {
#     'move_type': 2,
#     'limit': 3
# }

# # 请求
# res = requests.get(url, params=data, headers=headers).text
# print(res)


# driver = webdriver.PhantomJS(
#     executable_path=phantomjs_path)
# driver.set_page_load_timeout(500)
# driver.set_window_size(1680, 1050)
# driver.get(url)
# imgelement = driver.find_element_by_class_name('ding-table')
# print(driver.title)


chrome_options = Options()
chrome_options.add_argument('--headless')
chrome_options.add_argument('--disable-gpu')
driver = webdriver.Chrome(chrome_options=chrome_options)

def login(browser):
    browser.get(url_1)
    try:
        # elem = browser.find_element_by_class_name("go-login")
        # elem.click()

        # //*[@id="__layout"]/div/nav/div/div[2]/span[2]
        # elem = browser.find_element_by_xpath('//*[@id="__layout"]/div/nav/div/div[2]/span[2]')
        # elem.click()

        # elem = browser.find_element_by_css_selector(".go-login.nav-item")
        # elem.click()

        # 设置div的classname 'modal is-active login-modal'
        # var x = document.getElementsByClassName("example");
        # js="var q=document.getElementById(\"user_name\");q.style.border=\"1px solid red\";"
        js1 = "var e = document.getElementsByClassName('login-modal'); e.className = 'modal is-active login-modal';"
        js2 = "var div = document.getElementsByClassName('go-login nav-item'); div[0].click();"
        #调用js
        browser.execute_script(js2)
        time.sleep(3)
        # elem = browser.find_element_by_css_selector(".go-login.nav-item")
        # var div = document.getElementsByClassName('go-login nav-item');
        # div.setAttribute("className", "abc");

        # 输入账号和密码
        browser.find_element_by_class_name("login-phone-input").send_keys("13798385767")
        browser.find_element_by_class_name("login-setpwd-input").send_keys("123123ok")
        time.sleep(2)
 
        #点击按钮提交登录表单
        # browser.find_element_by_class_name("login-btn").click()
        js3 = "var div = document.getElementsByClassName('login-btn'); div[0].click();"
        browser.execute_script(js3)
        time.sleep(5)
 
        # 验证登录成功
        txt = browser.find_element_by_class_name("go-login").text
        if txt == u"pp@摸鱼科技":
            print(u"success")
        else:
            print(u"failure 1")
    except:
        print("Unexpected error:", sys.exc_info()[0])
        print(u"failure 2")


login(driver)
driver.get(url_2)
imgelement = driver.find_element_by_class_name('ding-table')
# print(imgelement.text)
print(driver.title)

# imgelement.text = imgelement.text.replace('600182', '600182\n其他 | 其他\n')
# str1 = r"'涨停池\n炸板池\n昨日涨停池\n强势股池\n跌停池\n新股池\n次新股池\n热点解读\n过滤新股\n过滤ST\n序号 股票名称 理由分析 最新价 涨跌幅 封单比 换手率 流通市值 总市值 首次封板 最后封板 开板 连板\n64 西陇科学\n002584\n创投 | 西陇创新园获国家级科技企业孵化器培育单位认定\n8.38 +9.97% 1.68% 22.83% 31.9亿 49.0亿 11:24:12 15:00:03 2 首板\n63 大港股份\n002077\n半导体 | 子公司艾科半导体主要业务是集成电路测试服务和射频测试设备\n7.73 +9.96% 0.19% 15.96% 41.1亿 44.9亿 09:33:48 14:56:57 13 4连板\n62 东方网络\n002175\n超高清视频 | 公司的子公司水木动画，拥有国内技术一流的动画制作团队以及海量丰富的动漫制作素材库。原创动画连续六年排名全国前列，累计了17万分钟高清动画片\n8.49 +9.97% 0.25% 36.73% 50.9亿 64.0亿 11:19:51 14:56:45 5 9连板\n61 银亿股份\n000981\n创投 | 下属控股子公司上海添泰置业有限公司投资2亿参与设立上海金浦临港智能科技股权投资基金合伙企业(有限合伙)，宁波容百新能源科技股份有限公司为其投资项目之一\n4.61 +10.02% 0.28% 8.55% 118.7亿 185.7亿 14:56:18 14:56:18 - 2连板\n60 东方电子\n000682\n电力物联网 | 以电力系统自动化、信息化和能源管理系统解决方案为主营业务\n6.03 +10.04% 0.61% 12.92% 59.0亿 80.8亿 09:25:03 14:56:15 6 3连板\n59 银河生物\n000806\n工业大麻 | 持有汉素生物5.55%股权，标的已获得国内工业大麻花叶加工许可资质，其海外参股子公司获得了美国肯塔基州大麻加工牌照，目前已建有GMP标准医用大麻萃取分离基地\n6.69 +10.03% 0.60% 18.52% 46.7亿 73.6亿 14:56:12 14:56:12 - 首板\n58 顺灏股份\n002565\n工业大麻 | 获工业大麻种植许可证\n13.83 +10.02% 0.26% 17.25% 94.7亿 98.1亿 10:15:57 14:55:57 19 首板\n57 数字认证\n300579\n知识产权 | 提供电子认证服务，电子认证产品及可管理的信息安全服务，子公司北京版信通技术有限公司提供版权保护服务；参股子公司北京版信通技术向华为开发者联盟提供APP版权综合管理服务\n41.64 +10.01% 0.20% 15.92% 20.0亿 50.0亿 09:31:06 14:55:48 19 首板\n56 佳隆股份\n002495\n创投 | 参股前海股权交易中心\n4.30 +9.97% 1.66% 17.41% 29.3亿 40.2亿 09:41:57 14:55:36 5 首板\n55 獐子岛\n002069\n食品 | 主营海珍品种业、海水增养殖，此前辽宁海参大面积被热死，公司称公司海洋牧场增养殖产品未发现异常\n5.64 +9.94% 0.14% 8.91% 38.8亿 40.1亿 10:45:57 14:55:09 3 2连板\n54 安控科技\n300370\n边缘计算 | 子公司科聪自动化是一家在工业物联网领域拥有控制系统平台软件、工业自动化软件、工业云软件、自动化移动应用软件和边缘计算平台的产品提供商；公司为边缘计算联盟会员单位\n6.97 +9.94% 0.37% 48.43% 49.8亿 66.8亿 09:25:03 14:54:27 14 8连板\n53 神奇制药\n600613\n医药 | 中药拥有中国驰名商标“神奇”品牌，其中枇杷止咳颗粒、强力枇杷露等较为知名\n10.43 +10.02% 0.14% 11.43% 50.0亿 55.7亿 14:54:19 14:54:19 - 首板\n52 龙津药业\n002750\n工业大麻 | 1500万元增资云南牧亚农业科技有限公司，并取得其51%股权。牧亚农业主要业务为规模化种植工业大麻\n18.41 +9.98% 0.46% 11.01% 73.1亿 73.7亿 09:48:39 14:54:18 7 首板\n51 华仪电气\n600290\n创投+电力物联网 | 拥有中高压输配电设备；投资设立浙江华仪创投有限公司，参股浙江股权交易中心\n6.96 +9.95% 0.54% 27.33% 52.9亿 52.9亿 10:39:42 14:53:56 22 3连板\n50 锐奇股份\n300126\n智能制造 | 发起设立高端智能装备产业基金；子公司擎宝机器人主营机器人控制系统等设备等\n6.61 +9.98% 0.28% 16.47% 13.9亿 20.1亿 09:34:30 14:53:54 8 首板\n49 德美化工\n002054\n壳公司+创投 | 拥有全资子公司广东德运创投，地处广东佛山顺德，主营纺织化学品、皮革化学品\n7.83 +9.97% 0.39% 26.88% 24.4亿 32.8亿 10:50:24 14:52:54 19 首板\n48 广博股份\n002103\n独角兽 | 抖音影子股；旗下子公司灵云传媒与为公司推广抖音、今日头条、西瓜视频等应用程式客户端下载。\n5.97 +9.94% 0.30% 23.46% 22.3亿 32.6亿 10:38:45 14:52:51 14 首板\n47 林州重机\n002535\n军工 | 公司被河南省武器装备科研生产单位保密资格认定委员会批准为三级保密资格单位；收购成都天科55%的股权，快速进入航空航天精密加工制造领域\n4.64 +9.95% 1.39% 14.22% 27.4亿 37.2亿 09:52:45 14:52:27 8 首板\n46 运达科技\n300440\n数字孪生 | 公司立足于十余年来在城轨列车状态集成感知、部件故障智能诊断、数字孪生应用等技术研究成果，开创性地实现城轨列车运行数据、状态数据、环境数据的采集与耦合，以此驱动虚拟列车模型，实现城轨列车健康状态与服役能力的评估与预测\n9.58 +9.99% 0.24% 10.62% 42.7亿 42.9亿 09:25:03 14:51:00 14 2连板\n45 绿茵生态\n002887\n雄安新区 | 参与建设了被媒体誉为“雄安第一标”的雄安市民服务中心项目\n23.28 +10.02% 0.39% 18.16% 12.0亿 37.2亿 09:53:15 14:50:54 10 首板\n44 盈方微\n000670\n半导体 | 主营SoC芯片设计，产品为面向平板电脑、智能家居、行业应用领域的应用处理器iMAPx系列和面向安防摄像头、运动相机、行车记录仪等领域的影像处理器Q系列\n6.89 +10.06% 0.43% 34.68% 41.3亿 56.3亿 11:12:57 14:50:54 4 4连板\n43 中迪投资\n000609\n房地产 | 成都市小型开发商\n6.77 +10.08% 0.95% 8.35% 19.8亿 20.3亿 09:55:33 14:50:42 2 首板\n42 中信国安\n000839\n其他 | 因股权转让，预告年报净利润18.00亿元至22.00亿，同比增长593.99%至748.2%，控股股东中信国安集团为中国中信集团公司子公司\n6.77 +10.08% 0.10% 11.27% 265.3亿 265.4亿 09:42:57 14:49:57 14 首板\n41 誉衡药业\n002437\n独角兽 | 在互动平台上表示，公司参投的苏州工业园区原点正则贰号创业投资企业（有限合伙）于2017年和2018年分别参与了江苏北人D轮和E轮融资\n6.07 +9.96% 0.20% 8.07% 131.5亿 133.4亿 10:18:39 14:49:24 24 2连板\n40 上海沪工\n603131\n长三角一体化 | 地处上海青浦，拥有机器人及自动化焊接（切割）成套设备；与全球最大机器人公司之一的FANUC结成合作伙伴\n26.07 +10.00% 0.24% 16.86% 13.0亿 57.6亿 10:46:06 14:49:04 17 首板\n39 世联行\n002285\n房地产 | 全国地产中介龙头之一，住房租赁概念龙头，推出长租公寓品牌红璞公寓\n6.60 +10.00% 0.04% 6.70% 132.7亿 134.8亿 13:58:30 14:48:42 9 首板\n38 交大昂立\n600530\n创投 | 交大系；收到有关部门关于有意在科创板第一批上市的企业申报排摸通知\n6.02 +10.05% 0.26% 5.59% 47.0亿 47.0亿 10:48:02 14:48:39 2 首板\n37 华控赛格\n000068\n创投 | 清华控股平台企业，在城市环保、水务和智慧城市领域拥有完整产品体系和解决方案；清华同衡规划设计研究院已入围雄安设计最终12家咨询机构名单。\n7.58 +10.01% 0.27% 16.67% 76.3亿 76.3亿 10:37:21 14:48:36 7 首板\n36 金杯电工\n002533\n电力物联网 | 主营电线电缆，在智能电网积极布局；拟收购武汉二线79.33%股权，标的主营生产电线电缆\n7.00 +10.06% 0.32% 15.98% 36.2亿 38.7亿 09:25:03 14:46:24 6 3连板\n35 绿庭投资\n600695\n创投 | 主营私募投资，拥有部分房产租赁任务\n6.61 +9.98% 0.54% 22.21% 24.2亿 47.0亿 10:40:03 14:42:04 4 首板\n34 瀚叶股份\n600226\n独角兽 | 持有上海雍棠99.50%股份，上海雍棠直接或间接投资了嘉楠耘智、浙大网新、世纪华通等众多高新技术企业\n4.57 +10.12% 0.63% 16.11% 91.1亿 143.4亿 10:10:57 14:32:31 7 2连板\n33 弘高创意\n002504\n独角兽 | 大股东弘高慧目持有中航装甲30%股权，中航装甲今年已入选天津第二批战略性新兴产业领军企业，条件允许大股东将全力支持申报科创板\n5.32 +9.92% 1.10% 29.98% 22.1亿 54.6亿 10:00:57 14:24:54 6 2连板\n32 张江高科\n600895\n独角兽 | 创投龙头企业之一，持股复旦张江21%的股权\n25.53 +10.00% 0.33% 7.78% 395.4亿 395.4亿 09:30:23 14:24:22 4 3连板\n31 中设股份\n002883\n高送转 | 与保通院战略合作参与雄安新区建设；17年年报10转6\n29.58 +10.00% 10.59% 32.89% 9.2亿 25.6亿 13:56:21 14:07:42 2 首板\n30 三维股份\n603033\n其他 | 主营业务将在橡胶输送带、V带的基础上新增混凝土枕业务；此前拟14.7亿元收购广西三维\n24.08 +10.00% 1.07% 4.21% 13.3亿 52.4亿 14:03:22 14:03:22 - 首板\n29 首开股份\n600376\n房地产 | 主要定位于北京市场的房地产开发，在北京通州等地区有土地储备\n8.99 +10.04% 0.14% 1.81% 228.9亿 231.9亿 13:31:39 13:53:15 10 首板\n28 横河模具\n300539\n其他 | 分时为庄股，主营精密塑料模具\n15.61 +10.01% 14.60% 30.87% 9.5亿 32.6亿 13:17:30 13:43:45 1 2连板\n27 海南海药\n000566\n独角兽 | 参股新光光电，后者接受科创板上市辅导\n7.65 +10.07% 1.32% 4.83% 92.1亿 102.2亿 13:30:18 13:39:57 2 首板\n26 华鼎股份\n601113\n其他 | 此前连续7日跌停，主营民用锦纶长丝\n9.65 +10.03% 1.71% 2.26% 80.4亿 112.1亿 11:16:20 11:16:20 - 首板\n25 德创环保\n603177\n雄安新区 | 国内少数既能够生产脱硫设备、蜂窝和平板式脱硝催化剂、湿式静电除尘器等关键产品\n13.75 +10.00% 32.41% 22.12% 8.5亿 27.8亿 10:39:53 10:50:39 2 2连板\n24 电子城\n600658\n创投 | 华平投资寻求募集40亿美元，设立另一支专注中国的私募股权基金，其在中国的投资公司为东久中国，为公司第三大股东\n7.01 +10.05% 0.78% 2.14% 78.4亿 78.4亿 10:40:53 10:40:53 - 首板\n23 三湘印象\n000863\n房地产 | 文化演艺+地产双主业，聚焦长三角与京津冀\n5.37 +10.04% 0.49% 2.04% 50.4亿 73.6亿 10:01:03 10:35:09 2 首板\n22 八菱科技\n002592\n汽车零部件 | 国内最大的汽车散热器原装整车配套企业之一；此前控股股东拟溢价近100%转让公司20%股份引进战略股东\n23.13 +9.99% 0.63% 4.14% 56.8亿 65.5亿 10:28:21 10:28:21 - 2连板\n21 盾安环境\n002011\n创投 | 持有浙江舟山如山汇盈创业投资合伙企业16.67%的股权，该公司主要业务为创业投资、投资管理、投资咨询\n6.44 +10.09% 1.07% 4.72% 54.2亿 59.1亿 10:18:45 10:18:45 - 首板\n20 天保基建\n000965\n房地产 | 主营房地产开发和基础设施建设，实控人为天津港保税区国有资产管理局旗下的天津保税区投资控股集团\n4.85 +9.98% 1.14% 5.81% 53.8亿 53.8亿 09:25:03 10:12:33 2 首板\n19 汉嘉设计\n300746\n次新股 | 我国最大的民营建筑设计企业之一\n23.53 +10.00% 4.12% 20.27% 12.4亿 49.5亿 10:00:09 10:00:09 - 首板\n18 新联电子\n002546\n电力物联网 | 国内电力信息采集系统的龙头，子公司拟收购能源服务公司13%股权\n6.67 +10.07% 1.37% 11.32% 52.0亿 55.6亿 09:25:03 09:57:42 1 3连板\n17 必创科技\n300667\n半导体 | 6.2亿元收购卓立汉光，标的是国内知名的光电仪器、精密组件和测试系统专业供应商\n36.18 +10.00% 1.38% 15.26% 24.8亿 36.9亿 09:25:03 09:56:03 2 3连板\n16 飞力达\n300240\n创投 | 参与投资了苏州钟鼎三号创业投资中心（有限合伙）、宁波梅山保税港区鼎越投资合伙企业等，间接持股的上飞装备收到科创板拟申报企业报名表\n9.25 +9.99% 1.13% 2.65% 33.8亿 33.8亿 09:52:18 09:52:18 - 首板\n15 上海三毛\n600689\n创投 | 拥有全资子公司上海嘉懿创投；间接持有沪江网0.6733%股份\n12.56 +9.98% 3.11% 10.96% 19.1亿 25.2亿 09:50:08 09:50:08 - 首板\n14 万集科技\n300552\n国资入股 | 地处北京海淀区，ETC行业市场占有率约20%，同时通过激光检测等业务在智能交通信息采集与处理细分领域处于龙头地位\n22.00 +10.00% 2.13% 6.56% 9.1亿 23.7亿 09:44:42 09:44:42 - 首板\n13 铭普光磁\n002902\n5G | 光通信-从事通信磁性元器件、通信光电部件产品；已成为三星、华为、中兴、烽火通信等通信设备厂商的重要供应商\n28.56 +10.02% 1.96% 13.83% 20.2亿 40.0亿 09:42:27 09:42:27 - 首板\n12 国中水务\n600187\n独角兽 | 通过参股赛领国际发展投资基金，间接投资万达、商汤科技\n3.89 +9.89% 2.17% 2.53% 56.6亿 64.3亿 09:30:02 09:30:02 - 首板\n11 楚天高速\n600035\n无人驾驶 | 并购重组三木智能，其主营平板电脑、智能手机方案设计和整机生产服务的企业，并开始布局车联网及物联网服务\n4.35 +10.13% 1.24% 1.96% 66.4亿 75.2亿 09:30:02 09:30:02 - 2连板\n10 中路股份\n600818\n知识产权 | 参股智能化知识产权平台权大师等公司。\n15.99 +9.97% 1.63% 1.43% 38.0亿 51.4亿 09:30:02 09:30:02 - 2连板\n9 华宝股份\n300741\n高送转 | 18年年报拟10派40元\n41.67 +10.01% 10.40% 3.09% 25.7亿 256.6亿 09:25:03 09:25:03 - 首板\n8 晓程科技\n300139\n半导体+电力物联网 | 主营电力线载波芯片及相关集成电路产品，主要用于智能电网\n14.39 +10.02% 12.55% 7.85% 30.6亿 39.4亿 09:25:03 09:25:03 - 5连板\n7 诚志股份\n000990\n工业大麻 | 公司与云南汉素等多方签订签署股权转让及增资框架协议，切入工业大麻领域；清华控股持股11.7%\n16.58 +10.02% 3.07% 0.72% 64.3亿 207.7亿 09:25:03 09:25:03 - 3连板\n6 赫美集团\n002356\n公告 | 拟发行股份吸收合并新三板上市公司英雄互娱，其被称为“中国移动电竞第一股”\n13.78 +9.98% 2.72% 0.13% 66.2亿 72.7亿 09:25:03 09:25:03 - 8连板\n5 裕同科技\n002831\n高送转 | 2018年度拟10转12派6元\n56.65 +10.00% 4.30% 2.39% 67.7亿 226.6亿 09:25:03 09:25:03 - 首板\n4 复旦复华\n600624\n创投 | 复旦系；从事高新技术园区建设及相关房产开发二十多年，在相关领域积累了丰富的运作经验，在嘉定拥有国内首家由企业创办的高新技术园区—国家级上海复华高新技术园区\n9.08 +10.06% 5.08% 0.80% 62.2亿 62.2亿 09:25:00 09:25:00 - 3连板\n3 华铁科技\n603300\n公告 | 获杭州财开投资集团举牌，持股超过5%，财开投资集团为杭州金投集团全资子公司\n7.35 +10.03% 0.72% 1.22% 33.4亿 35.7亿 09:25:00 09:25:00 - 2连板\n2 国电南自\n600268\n电力物联网 | 国家电网旗下上市公司，拥有直流充电桩、交流充电桩、充电监控平台和充电运营平台的充电系统解决方案\n6.52 +9.95% 5.96% 0.92% 41.4亿 45.3亿 09:25:00 09:25:00 - 3连板\n1 南京高科\n600064\n独角兽 | 旗下公司参股新三板赛特斯，其拟登陆科创板\n12.06 +10.04% 2.08% 1.13% 149.1亿 149.1亿 09:25:00 09:25:00 - 首板\n点击可展开股票池'"
# list1 = str1.split('\\n')
list1 = imgelement.text.split('\n')
# list1 = imgelement.text.replace('603982', '603982\n其他 |其他\n').split('\n')
# list1 = imgelement.text.replace('603317', '603317\n其他 |其他\n').replace('300769', '300769\n其他 |其他\n').split('\n')

list2 = []
title_table = ''
dic_table = {}
print(list1)
print(1)

tbc = True
while tbc:
    item = list1.pop(0)
    if item.startswith(u'序号'):
        temp = item.split(' ')
        for item2 in temp:
            dic_table[item2] = ''
        # list1.remove(item)
        title_table = '\t'.join(temp)

        tbc = False # 这个时候就可以停止循环了
        list1.pop() # 去掉最后一行无用行
    else:
        # list1.remove(item)
        # list1.pop()
        pass


# 序号 股票名称 理由分析 最新价 涨跌幅 封单比 换手率 流通市值 总市值 首次封板 最后封板 开板 连板
for i in range(0, len(list1), 4):
# for i in range(0, len(list1)):

    # 55 科力尔
    # 002892
    # 其他 | 疑似庄股，微特电机优质制造商
    # 48.93 +10.00% 5.13% 16.27% 12.9亿 40.9亿 14:30:21 14:30:21 - 首板
    # 54 S佳通
    # 600182 17.88 +4.99% 0.14% 3.90% 30.4亿 60.8亿 10:22:16 14:29:30 11 首板
    # 53 天华超净
    # 300390
    # 高送转 | 18年年报10转6派1.5元
    # 11.41 +10.03% 2.11% 23.14% 21.3亿 39.3亿 14:25:42 14:25:42 - 2连板
    # 52 三木集团
    # 000632
    # 福建自贸/海西概念 | 公司主营房地产开发与经营、进出口贸易
    # 5.19 +9.96% 0.13% 7.44% 24.2亿 24.2亿 10:55:24 14:25:30 11 首板
    # if not list1[i].startswith(r'^\d+') or not list1[i + 4].startswith(r'^\d+'):
    #     continue

    dic_table = {}

    dic_table['序号'] = list1[i].split(' ')[0]
    dic_table['股票名称'] = list1[i].split(' ')[1]
    dic_table['股票代码'] = list1[i + 1]

    try:
        dd = list1[i + 2].split(' ')
        if len(dd) == 3:
            dic_table['概念板块'] = list1[i + 2].split(' ')[0]
            # dic_table['理由分析'] = list1[i + 2]
            dic_table['涨停理由'] = list1[i + 2].split(' ')[2]
        else:
            dic_table['概念板块'] = ""
            dic_table['涨停理由'] = list1[i + 2].split(' ')[0]

    
        xx = list1[i + 3].split(' ')
        dic_table['最新价'] = xx[0]
        dic_table['涨跌幅'] = xx[1]
        dic_table['封单比'] = xx[2]
        dic_table['换手率'] = xx[3]
        dic_table['流通市值'] = xx[4]
        dic_table['总市值'] = xx[5]
        dic_table['首次封板'] = xx[6]
        dic_table['最后封板'] = xx[7]
        dic_table['开板次数'] = xx[8]
        dic_table['连板次数'] = xx[9]

        # i = i + 4
        # list2.insert(i % 4, dic_table)
        list2.append(dic_table)
        pass
    except Exception as ex:
        print(ex)
        print(list1[i])
        # i = i + 2
        pass


df = pd.DataFrame(list2, 
                columns=['序号', '股票名称', '股票代码', '概念板块', '最新价', '涨跌幅', 
                '封单比', '换手率', '流通市值', '总市值', '首次封板', '最后封板', '开板次数', '连板次数', '涨停理由'])
df.set_index(['序号'])
# df.to_csv(r'D:\tools\test.csv', sep='\t')

filename1 = time.strftime(r'D:\tools\ztfx_%Y%m%d.csv', time.localtime())
filename2 = time.strftime(r'D:\tools\ztfx_%Y%m%d.xls', time.localtime())
df.to_csv(filename1)
df.to_excel(filename2)
print(2)

driver.close()
driver.quit()
